"""

Πόσα δευτερόλεπτα είναι τα 42 λεπτά και 42 δευτερόλεπτα;

"""

total_sec = 42 * 60 + 42
print(total_sec, "seconds")


"""

Πόσα μίλια αντιστοιχούν στα 10 χιλιόμετρα; Υπόδειξη: Ένα μίλι είναι
1.61 χιλιόμετρα.

"""

miles = 10 * 1 / 1.61
print(miles, "miles")


"""

Αν τρέξετε έναν αγώνα δρόμο 10 χιλιομέτρων σε 42 λεπτά και 42
δευτερόλεπτα, ποια είναι η μέση ταχύτητά σας σε μίλια ανά ώρα;

"""

min_to_hours = 42 / 60
sec_to_hours = 42 / 3600
total_hour = min_to_hours + sec_to_hours
u = miles / total_hour      # μέση ταχύτητα(u) = distance/time
print(u, "mph")
