import random

def InputReader ():
    #Αναλαμβάνει το διάβασμα των ερωτήσεων του χρήστη 
    inputLine = raw_input(">>> ")
    return inputLine

def Responder (L):
    thesi = random.randrange(0, len(L))
    return L[thesi]

APANTISEIS=["Αυτό ακούγεται περίεργο. Μπορείτε μου δώσετε περισσότερες λεπτομέρειες;",
            "Είστε ο πρώτος πελάτης που παραπονιέται γι' αυτό. Τι έκδοση Windows έχετε;",
            "Αυτό ακούγεται ενδιαφέρον, πείτε μου περισσότερα...",
            "Χρειάζεται να μου περιγράψετε καλύτερα το πρόβλημα.",
            "Ελέγξατε αν όλα τα αρχεία DLL βρίσκονται στον φάκελο εγκατάστασης;",
            "Η απάντηση βρίσκεται στο εγχειρίδιο. Το έχετε διαβάσει;",
            "Αυτή είναι η σωστή λειτουργία. Δεν αποτελεί πρόβλημα!",
            "Μπορείτε να εξηγήσετε το πρόβλημα με περισσότερες λεπτομέρειες;"]


print "Καλωσήρθατε στην τεχνική υποστήριξη."
print "Πως μπορώ να σας βοηθήσω;"
print "Αν θέλετε να τερματίσετε την συνομιλία παρακαλώ γράψτε: γεια"
telos=False
while telos != True:
    erwthsh=InputReader()
    if erwthsh=="γεια":
        telos=True
    else:
        apanthsh=Responder(APANTISEIS)
        print apanthsh
print "Ελπίζω να σας βοήθησα. Γειά σας."
